## Plan Result (883: sbox_ai - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 27 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.cognitive_account_primary_access_key
  * azurerm_key_vault_secret.cognitive_account_secondary_access_key
  * azurerm_resource_group.rg
  * azurerm_role_assignment.poc_group
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_ai_foundry_project.ai_foundry_project
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.ai.azurerm_private_endpoint.cognitive_private_endpoint
  * module.ai.azurerm_private_endpoint.foundry_private_endpoint
  * module.ai.azurerm_private_endpoint.ml_private_endpoint
  * module.ai.azurerm_role_assignment.cog_blob_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.cog_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_contributor_from_to_ai_storage_account
  * module.ai.azurerm_storage_account.workspace_storage_account
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.key_vault.azurerm_key_vault.kv
  * module.key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.ai.azurerm_role_assignment.cog_blob_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.cog_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.ml_contributor_to_file_storage_account[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.cognitive_account_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "cognitive_account_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cognitive-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cognitive_account_secondary_access_key will be created
  + resource "azurerm_key_vault_secret" "cognitive_account_secondary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cognitive-account-secondary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-ai-sbox"
      + tags     = (known after apply)
    }

  # azurerm_role_assignment.poc_group will be created
  + resource "azurerm_role_assignment" "poc_group" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0e75592-f51f-46c3-84ef-df609b08eb68"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be created
  + resource "azurerm_ai_foundry" "ai_foundry" {
      + discovery_url                = (known after apply)
      + high_business_impact_enabled = (known after apply)
      + id                           = (known after apply)
      + key_vault_id                 = (known after apply)
      + location                     = "uksouth"
      + name                         = "dlrm-ingest-ai-foundry-sbox"
      + public_network_access        = "Enabled"
      + resource_group_name          = "dlrm-ingest-ai-sbox"
      + storage_account_id           = (known after apply)
      + tags                         = (known after apply)
      + workspace_id                 = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + managed_network {
          + isolation_mode = "AllowInternetOutbound"
        }
    }

  # module.ai.azurerm_ai_foundry_project.ai_foundry_project will be created
  + resource "azurerm_ai_foundry_project" "ai_foundry_project" {
      + ai_services_hub_id           = (known after apply)
      + high_business_impact_enabled = (known after apply)
      + id                           = (known after apply)
      + location                     = "uksouth"
      + name                         = "dlrm-ingest-project-sbox"
      + project_id                   = (known after apply)
      + tags                         = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be created
  + resource "azurerm_cognitive_account" "cognitive_account" {
      + custom_subdomain_name              = "dlrm-ingest-cognitive-account-sbox"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "FormRecognizer"
      + local_auth_enabled                 = true
      + location                           = "uksouth"
      + name                               = "dlrm-ingest-cognitive-account-sbox"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "dlrm-ingest-ai-sbox"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
      + tags                               = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be created
  + resource "azurerm_machine_learning_workspace" "ml_workspace" {
      + application_insights_id         = (known after apply)
      + discovery_url                   = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + kind                            = "Default"
      + location                        = "uksouth"
      + name                            = "dlrm-ingest-ml-workspace-sbox"
      + public_network_access_enabled   = true
      + resource_group_name             = "dlrm-ingest-ai-sbox"
      + service_side_encryption_enabled = false
      + sku_name                        = "Basic"
      + storage_account_id              = (known after apply)
      + tags                            = (known after apply)
      + v1_legacy_mode_enabled          = false
      + workspace_id                    = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + managed_network {
          + isolation_mode                = "AllowInternetOutbound"
          + provision_on_creation_enabled = false
        }
    }

  # module.ai.azurerm_private_endpoint.cognitive_private_endpoint will be created
  + resource "azurerm_private_endpoint" "cognitive_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-cognitive-account-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "cognitive-account-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.ai.azurerm_private_endpoint.foundry_private_endpoint will be created
  + resource "azurerm_private_endpoint" "foundry_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-ai-foundry-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ai-foundry-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.ai.azurerm_private_endpoint.ml_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ml_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-ml-workspace-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ml-workspace-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.ai.azurerm_role_assignment.cog_blob_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "cog_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.cog_blob_contributor_to_file_storage_account[0] must be replaced
-/+ resource "azurerm_role_assignment" "cog_blob_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00sftpsbox/providers/Microsoft.Authorization/roleAssignments/5b3b98ce-9739-7fb1-bd97-8866caa1b737" -> (known after apply)
      ~ name                                   = "5b3b98ce-9739-7fb1-bd97-8866caa1b737" -> (known after apply)
      ~ principal_id                           = "69485e71-c251-42ea-b90b-e263e1fa5954" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.cog_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "cog_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.cog_contributor_to_file_storage_account[0] must be replaced
-/+ resource "azurerm_role_assignment" "cog_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00sftpsbox/providers/Microsoft.Authorization/roleAssignments/33ed70ab-4daa-96d9-4dc5-3f3122e69857" -> (known after apply)
      ~ name                                   = "33ed70ab-4daa-96d9-4dc5-3f3122e69857" -> (known after apply)
      ~ principal_id                           = "69485e71-c251-42ea-b90b-e263e1fa5954" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "ml_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0] must be replaced
-/+ resource "azurerm_role_assignment" "ml_blob_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00sftpsbox/providers/Microsoft.Authorization/roleAssignments/a8370692-363b-f66b-f848-b7d6fc35105a" -> (known after apply)
      ~ name                                   = "a8370692-363b-f66b-f848-b7d6fc35105a" -> (known after apply)
      ~ principal_id                           = "0c350b40-2060-44e5-b124-3da17cabcc4a" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_role_assignment.ml_contributor_from_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "ml_contributor_from_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_contributor_to_file_storage_account[0] must be replaced
-/+ resource "azurerm_role_assignment" "ml_contributor_to_file_storage_account" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00sftpsbox/providers/Microsoft.Authorization/roleAssignments/75cf0cda-4186-e236-5285-9662f5403e71" -> (known after apply)
      ~ name                                   = "75cf0cda-4186-e236-5285-9662f5403e71" -> (known after apply)
      ~ principal_id                           = "0c350b40-2060-44e5-b124-3da17cabcc4a" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account will be created
  + resource "azurerm_storage_account" "workspace_storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "dlrmingestaisasbox"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "dlrm-ingest-ai-sbox"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = (known after apply)

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + cors_rule {
              + allowed_headers    = [
                  + "*",
                ]
              + allowed_methods    = [
                  + "DELETE",
                  + "GET",
                  + "HEAD",
                  + "MERGE",
                  + "POST",
                  + "OPTIONS",
                  + "PUT",
                  + "PATCH",
                ]
              + allowed_origins    = [
                  + "https://documentintelligence.ai.azure.com",
                  + "https://mlworkspace.azure.ai",
                  + "https://ml.azure.com",
                  + "https://*.ml.azure.com",
                  + "https://ai.azure.com",
                  + "https://*.ai.azure.com",
                ]
              + exposed_headers    = [
                  + "*",
                ]
              + max_age_in_seconds = 120
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = [
              + "20.3.165.95",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "dlrm-ingest-ai-appinsights-sbox"
      + resource_group_name                   = "dlrm-ingest-ai-sbox"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = (known after apply)
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application-Insights-daily-cap-reached-dlrm-ingest-ai-appinsights-sbox"
      + resource_group_name = "dlrm-ingest-ai-sbox"
      + scopes              = (known after apply)
      + tags                = (known after apply)

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "dlrm-ingest-ai-kv-sbox"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "dlrm-ingest-ai-sbox"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = (known after apply)
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "59bab40b-0894-4faf-9f92-0f627108107a"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                           = "dlrm-ingest-ai-kv-sbox"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric (known after apply)

      + metric (known after apply)
    }

Plan: 27 to add, 0 to change, 4 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
      - id         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox" -> null
      - name       = "dlrm-ingest-ai-sbox" -> null
        tags       = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
        # (2 unchanged attributes hidden)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry has been deleted
  - resource "azurerm_ai_foundry" "ai_foundry" {
      - id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-sbox" -> null
      - location                       = "uksouth" -> null
        name                           = "dlrm-ingest-ai-foundry-sbox"
        tags                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
        # (12 unchanged attributes hidden)

      - identity {
          - principal_id = "eabb81c5-6973-4537-a527-90d8200fd5e1" -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account has been deleted
  - resource "azurerm_cognitive_account" "cognitive_account" {
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox" -> null
        name                               = "dlrm-ingest-cognitive-account-sbox"
      - primary_access_key                 = (sensitive value) -> null
      - secondary_access_key               = (sensitive value) -> null
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
        # (11 unchanged attributes hidden)

      - identity {
          - principal_id = "69485e71-c251-42ea-b90b-e263e1fa5954" -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace has been deleted
  - resource "azurerm_machine_learning_workspace" "ml_workspace" {
      - id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-sbox" -> null
        name                           = "dlrm-ingest-ml-workspace-sbox"
        tags                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
        # (17 unchanged attributes hidden)

      - identity {
          - principal_id = "0c350b40-2060-44e5-b124-3da17cabcc4a" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account has been deleted
  - resource "azurerm_storage_account" "workspace_storage_account" {
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox" -> null
        name                               = "dlrmingestaisasbox"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_application_insights.this has been deleted
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "49d3656a-9cbb-47fc-bfa3-fd4a82b06c24" -> null
      - connection_string                     = (sensitive value) -> null
      - id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/components/dlrm-ingest-ai-appinsights-sbox" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - name                                  = "dlrm-ingest-ai-appinsights-sbox" -> null
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
        # (13 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault.kv has been deleted
  - resource "azurerm_key_vault" "kv" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox" -> null
      - name                            = "dlrm-ingest-ai-kv-sbox" -> null
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2025-09-30"
        }
      - vault_uri                       = "https://dlrm-ingest-ai-kv-sbox.vault.azure.net/" -> null
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":112,"Program":"tfcmt","SHA1":"","Target":"883: sbox_ai - TerraformPlanApply","Vars":{}} -->